let lOE = [];
/*Лист событий:
[День]->[Предмет]->[Участие в предмете/Разговор с одноклассником/побег]
[Разговор с однакласником]->[С кем разговор]
[Побег]->[если побег:удачный/неудачный]
Предметы:
0 - Информатика
1 - Математический анализ
2 - Линейная алгебра
3 - Иностранные языки
4 - Социальные науки
5 - Языки и методы программирования
6 - Физическая культура
*/
// День 0.
lOE[0] = [];
// Предмет информатика.
lOE[0][0] = [];
// Игрок участвует в процессе.
lOE[0][0][0] = [
	function() {

	}
];
// Игрок решил поговорить с однокласником.
lOE[0][0][1] = [];
// Игрок пытается уйти с занятия.
lOE[0][0][2] = [
	// У игрока получилось.
	function() {

	},
	// У игрока не получилось.
	function() {

	}
];

lOE[0][1] = [];
lOE[0][1][0] = [
	function() {

	}
];
lOE[0][1][1] = [];
lOE[0][1][2] = [
	function() {

	},
	function() {

	}
];

lOE[0][2] = [];
lOE[0][2][0] = [
	function() {

	}
];
lOE[0][2][1] = [];
lOE[0][2][2] = [
	function() {

	},
	function() {

	}
];

lOE[0][3] = [];
lOE[0][3][0] = [
	function() {

	}
];
lOE[0][3][1] = [];
lOE[0][3][2] = [
	function() {

	},
	function() {

	}
];

lOE[0][4] = [];
lOE[0][4][0] = [
	function() {

	}
];
lOE[0][4][1] = [];
lOE[0][4][2] = [
	function() {

	},
	function() {

	}
];

lOE[0][5] = [];
lOE[0][5][0] = [
	function() {

	}
];
lOE[0][5][1] = [];
lOE[0][5][2] = [
	function() {

	},
	function() {

	}
];

lOE[0][6] = [];
lOE[0][6][0] = [
	function() {

	}
];
lOE[0][6][1] = [];
lOE[0][6][2] = [
	function() {

	},
	function() {

	}
];
